* Hello World

Program.cs:  

#+NAME: Complete-Hello-World-Examples
#+BEGIN_SRC csharp :results value verbatim :exports both
#r "nuget:NTrospection.CLI,2.0.0"

using System;
using NTrospection.CLI.Core;
using NTrospection.CLI.Attributes;

public static class Program
{
  public static void Main(string[] args)
  {
     new Processor().ProcessArguments(args);
  }
}
  
[CliController("example", "a container for example commands")]
public static class ExampleController
{
  [CliCommand("hello", "says 'Hello' to the given name")]
  public static void HelloWorld(string name)
  {
    System.Console.WriteLine("Hello, " + name);
  }

  [CliCommand("goodbye", "says 'Good-bye' to the given name")]
  public static void GoodbyeWorld(string name = "World")
  {
    System.Console.WriteLine("Good-bye, " + name);
  }
}

Console.WriteLine("==== Command Execution ====");
var inputArgs = new string[]{"example", "hello", "--name", "World"};
Program.Main(inputArgs);
Console.WriteLine("==== Command Execution ====");

Console.WriteLine();

Console.WriteLine("==== Command Help ====");
inputArgs = new string[]{"example", "hello", "--name", "World", "?"};
Program.Main(inputArgs);
Console.WriteLine("==== Command Help ====");

Console.WriteLine();

Console.WriteLine("==== Controller Help ====");
inputArgs = new string[]{"example", "?"};
Program.Main(inputArgs);
Console.WriteLine("==== Controller Help ====");

Console.WriteLine();

Console.WriteLine("==== Program Help ====");
inputArgs = new string[]{"?"};
Program.Main(inputArgs);
Console.WriteLine("==== Program Help ====");

#+END_SRC

#+RESULTS: Complete-Hello-World-Examples
#+begin_example
==== Command Execution ====
Hello, World
==== Command Execution ====

==== Command Help ====

hello
Description: says 'Hello' to the given name
Parameters:
--name (String): This parameter is Required
==== Command Help ====

==== Controller Help ====

hello
Description: says 'Hello' to the given name
Parameters:
--name (String): This parameter is Required

goodbye
Description: says 'Good-bye' to the given name
Parameters:
--name (String): This parameter is Optional
==== Controller Help ====

==== Program Help ====
example - a container for example commands
==== Program Help ====
#+end_example
